:PROPERTIES:
:ID:       9112127d-96f8-47f7-b359-e1ceb5056d94
:END:
#+title: programming-idx

assembly
[[id:683d6936-787d-4cd0-bb00-274ac75d0fc6][taoalp]]

[[id:fe411eef-058b-4fe7-909f-6c4214bcc636][algorithms idx]]
[[id:dea16eb4-d34a-421b-b037-9f3e606ec001][git]]

tse
lisp
  scheme
    [[id:8f689d2c-c85c-4020-b7da-d56d3f6a7acc][guile]]
    racket
  [[id:292ecba9-bd17-40cd-b3cd-aceec77ebe6d][clojure]]
insert snippets
  SPC-i-s

#+begin_src C
#include <stdio.h>
int main()
  {
    printf("Hello World");
    return 0;
  }
#+end_src

#+RESULTS:
: Hello World

#+BEGIN_SRC clojure :results output
(println "test")
#+END_SRC

#+RESULTS:
: test


#+begin_src clojure :results output
(println "foo")
#+end_src

#+RESULTS:
: foo



#+begin_src bash
echo "test"

#+end_src

#+RESULTS:
: test

#+begin_src python :results output
print("hello there")
x = "well this is niece"

#+end_src

#+RESULTS:
: hello there

o
